Update README.md
Added mermaid chart for Architecture
